{"_id":{"$oid":"5e31e32bf1fba5c9fb924271"},"Title":"John Wick 3","Description":"John wick is on the run after killing a member of the international assassins's guild, and with a $14 million price tag on his head, he is the target of hit men and women everywhere","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thurst into a series of events that typically include violence, extended fighting, physical feats, and frantic chases"},"Director":{"Name":"Chad Stahelski","Bio":"Chad Stahelski was born in...","Born":"September 20, 1968"}}
{"_id":{"$oid":"5e31d13b4920480af845991f"},"Title":"Avengers","Description":"A group of heroes need to assemble if they want to save the world from the mischevious Loki","Genre":{"Name":"Superhero Films","Description":"A superhero film, superhero movie, or superhero motion picture is a film that is focused on the actions of one or more superheroes individuals who usually possess superhuman abilities relative to a normal person and are dedicated to protecting the public."},"Director":{"Name":"Joss Whedon","Bio":"Joss Whedon was born in...","Born":"June 23, 1964"},"Bio":"The famous producer for the first avengers movie"}
{"_id":{"$oid":"5e31dbbdf1fba5c9fb92426a"},"Title":"Avengers: Infinity War","Description":"The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe. ","Genre":{"Name":"Superhero films","Description":"A superhero film, superhero movie, or superhero motion picture is a film that is focused on the actions of one or more superheroes, individuals who usually possess superhuman abilities relative to a normal person and are dedicated to protecting the public."},"Director":{"Name":"Anthony Russo","Bio":"Anthony Russo was born in...","Born":"February 3, 1970"}}
{"_id":{"$oid":"5e31dcd6f1fba5c9fb92426b"},"Title":"Avengers: Endgame","Description":"After the devastating events of Avengers: Infinity War(2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse the actions of Thanos and restore balance to the universe","Genre":{"Name":"Superhero Films","Description":"A superhero film, superhero movie, or superhero motion picture is a film that is focused on the actions of one or more superheroes, individuals who usually possess superhuman abilities relative to a normal person and are dedicated to protecting the public."},"Directors":{"Name":"Anthony Russo","Bio":"Anthony Russo was born in...","Born":"February 3, 1970"}}
{"_id":{"$oid":"5e31e148f1fba5c9fb92426f"},"Title":"The Dark Knight Rises","Description":"Eight years after the Joker's reign of anarchy, Batman, with the help of the engimatic Catwoman, is forced from his exile to save Gotham City from the brutal gerrilla terrorist Bane","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thurst into a series of events that typically include voilence, extended fighting, physical feats, and frantic chases."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan was born in...","Born":"July 30, 1970"}}
{"_id":{"$oid":"5e31e06df1fba5c9fb92426e"},"Title":"The Dark Knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thurst into a series of events that typically include violence, extended fighting, physical feats, and frantic chases."},"Directors":{"Name":"Christopher Nolan","Bio":"Christopher Nolan was born in...","Born":"July 30, 1970"}}
{"_id":{"$oid":"5e31de6cf1fba5c9fb92426c"},"Title":"The Departed","Description":"An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.","Genre":{"Name":"Crime","Description":"Comedy films are 'make em laugh' films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment."},"Directors":{"Name":"Martin Scorsese","Bio":"Martin Scorses was born in...","Born":"November 17, 1942"}}
{"_id":{"$oid":"5e31e21cf1fba5c9fb924270"},"Title":"Avengers: Age of Ultron","Description":"When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, thing's go horribly wrong and it's up to Earth's mightiest heroes to stop Ultron","Genre":{"Name":"Superhero Films","Description":"A superhero film, superhero movie, or superhero motion picture is a film that is focused on the actions of one or more superheroes, individuals who usually possess superhuman abilities relative to a normal person and are dedicatedt to protecting the public"},"Director":{"Name":"Joss Whedon","Bio":"Joss Whedon was born in...","Born":"June 23, 1964"}}
{"_id":{"$oid":"5e31df22f1fba5c9fb92426d"},"Title":"Get Out","Description":"A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point.","Genre":{"Name":"Comedy","Description":"Comedy films are 'make em laugh' films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment. "},"Director":{"Name":"Jordan Peele","Born":"February 21, 1979"}}
{"_id":{"$oid":"5e31e47af1fba5c9fb924272"},"Title":"The Hangover","Description":"Three buddies wake up from a bachelor party in Las Vegas, with no memory of the prvious night and the bachelor missing. They make their way around the city in order to find their friend before his wedding","Genre":{"Name":"Comedy","Description":"Comedy films are 'make em laugh' films designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafter to amuse, entertain, and provoke enjoyment"},"Director":{"Name":"Todd Phillips","Bio":"Todd Phillips was born in...","Born":"December 20,1970"}}
